#### Terraform Plan - DEV 🌍
  <details><summary>Show Plan</summary>
  
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + automatic_channel_upgrade           = "stable"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "dev-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + local_account_disabled              = true
      + location                            = "eastus"
      + name                                = "dev-aks"
      + node_resource_group                 = "dev-rg-workload-aks-nodes"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "dev-rg-workload"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
          + "environment" = "dev"
        }
      + workload_identity_enabled           = true

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = []
          + azure_rbac_enabled     = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = 110
          + min_count            = 2
          + name                 = "system"
          + node_count           = 2
          + node_labels          = {
              + "environment"   = "dev"
              + "nodepool-type" = "system"
              + "nodepoolos"    = "linux"
            }
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 128
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + tags                 = {
              + "CostCenter"  = "IT-Development"
              + "Environment" = "dev"
              + "ManagedBy"   = "Terraform"
              + "Project"     = "azureapp"
            }
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D4s_v3"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
          + zones                = [
              + "1",
              + "2",
              + "3",
            ]

          + upgrade_settings {
              + max_surge = "33%"
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress_application_gateway {
          + effective_gateway_id                 = (known after apply)
          + gateway_id                           = (known after apply)
          + ingress_application_gateway_identity = (known after apply)
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "2m"
        }

      + maintenance_window {
          + allowed {
              + day   = "Sunday"
              + hours = [
                  + 2,
                  + 3,
                  + 4,
                ]
            }
        }

      + microsoft_defender {
          + log_analytics_workspace_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip          = "10.2.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "10.2.0.0/16"
          + service_cidrs           = (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id = (known after apply)
          + oms_agent_identity         = (known after apply)
        }
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.user[0] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "user" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 10
      + max_pods              = 110
      + min_count             = 2
      + mode                  = "User"
      + name                  = "user"
      + node_count            = 2
      + node_labels           = {
          + "environment"   = "dev"
          + "nodepool-type" = "user"
          + "nodepoolos"    = "linux"
        }
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = 128
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D4s_v3"
      + vnet_subnet_id        = (known after apply)
      + zones                 = [
          + "1",
          + "2",
          + "3",
        ]

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.aks.azurerm_monitor_diagnostic_setting.aks will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "diag-dev-aks"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "cluster-autoscaler"
        }
      + enabled_log {
          + category = "kube-apiserver"
        }
      + enabled_log {
          + category = "kube-audit"
        }
      + enabled_log {
          + category = "kube-controller-manager"
        }
      + enabled_log {
          + category = "kube-scheduler"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.aks.azurerm_role_assignment.agic_appgw_contributor[0] will be created
  + resource "azurerm_role_assignment" "agic_appgw_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_role_assignment.agic_appgw_rg_reader[0] will be created
  + resource "azurerm_role_assignment" "agic_appgw_rg_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/b2b8a5e6-9a34-494b-ba62-fe9be95bd398/resourceGroups/dev-rg-hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_user_assigned_identity.agic will be created
  + resource "azurerm_user_assigned_identity" "agic" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "dev-agic-uai"
      + principal_id        = (known after apply)
      + resource_group_name = "dev-rg-workload"
      + tags                = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + tenant_id           = (known after apply)
    }

  # module.aks.azurerm_user_assigned_identity.uai will be created
  + resource "azurerm_user_assigned_identity" "uai" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "dev-aks-uai"
      + principal_id        = (known after apply)
      + resource_group_name = "dev-rg-workload"
      + tags                = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + tenant_id           = (known after apply)
    }

  # module.appgw.azurerm_application_gateway.this will be created
  + resource "azurerm_application_gateway" "this" {
      + enable_http2                = true
      + firewall_policy_id          = (known after apply)
      + id                          = (known after apply)
      + location                    = "eastus"
      + name                        = "dev-appgw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "dev-rg-hub"
      + tags                        = {
          + "CostCenter"      = "IT-Development"
          + "Environment"     = "dev"
          + "ManagedBy"       = "Terraform"
          + "Project"         = "azureapp"
          + "environment"     = "dev"
          + "managed_by_agic" = "true"
        }
      + zones                       = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 3
          + min_capacity = 1
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "default-backend"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "default-http-setting"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "default-health-probe"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []

          + connection_draining {
              + drain_timeout_sec = 60
              + enabled           = true
            }
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "default-https-setting"
          + pick_host_name_from_backend_address = true
          + port                                = 443
          + probe_id                            = (known after apply)
          + probe_name                          = "default-https-probe"
          + protocol                            = "Https"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []

          + connection_draining {
              + drain_timeout_sec = 60
              + enabled           = true
            }
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appgw-frontend-public"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "frontendPort443"
          + port = 443
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "frontendPort80"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "appgw-ipcfg"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appgw-frontend-public"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "frontendPort80"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "default-health-probe"
          + path                                      = "/healthz"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "default-https-probe"
          + path                                      = "/healthz"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "default-backend"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "default-http-setting"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "http-listener"
          + id                         = (known after apply)
          + name                       = "rule1"
          + priority                   = 100
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Prevention"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.2"
        }
    }

  # module.appgw.azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "dev-appgw-pip"
      + resource_group_name     = "dev-rg-hub"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.appgw.azurerm_user_assigned_identity.appgw will be created
  + resource "azurerm_user_assigned_identity" "appgw" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "dev-appgw-uai"
      + principal_id        = (known after apply)
      + resource_group_name = "dev-rg-hub"
      + tags                = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + tenant_id           = (known after apply)
    }

  # module.appgw.azurerm_web_application_firewall_policy.waf will be created
  + resource "azurerm_web_application_firewall_policy" "waf" {
      + http_listener_ids   = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "dev-waf-policy"
      + path_based_rule_ids = (known after apply)
      + resource_group_name = "dev-rg-hub"
      + tags                = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }

      + custom_rules {
          + action               = "Block"
          + enabled              = true
          + name                 = "RateLimitRule"
          + priority             = 1
          + rate_limit_duration  = "OneMin"
          + rate_limit_threshold = 100
          + rule_type            = "RateLimitRule"

          + match_conditions {
              + match_values       = [
                  + "0.0.0.0/0",
                ]
              + negation_condition = false
              + operator           = "IPMatch"

              + match_variables {
                  + variable_name = "RemoteAddr"
                }
            }
        }

      + managed_rules {
          + managed_rule_set {
              + type    = "OWASP"
              + version = "3.2"
            }
          + managed_rule_set {
              + type    = "Microsoft_BotManagerRuleSet"
              + version = "1.0"
            }
        }

      + policy_settings {
          + enabled                                   = true
          + file_upload_limit_in_mb                   = 100
          + js_challenge_cookie_expiration_in_minutes = 30
          + max_request_body_size_in_kb               = 128
          + mode                                      = "Prevention"
          + request_body_check                        = true
          + request_body_inspect_limit_in_kb          = 128
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_endpoint.endpoint will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "dev-fd-endpoint"
      + tags                     = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_firewall_policy.waf will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "waf" {
      + custom_block_response_status_code = 403
      + enabled                           = true
      + frontend_endpoint_ids             = (known after apply)
      + id                                = (known after apply)
      + mode                              = "Prevention"
      + name                              = "devfdwafpolicy"
      + request_body_check_enabled        = true
      + resource_group_name               = "dev-rg-hub"
      + sku_name                          = "Standard_AzureFrontDoor"
      + tags                              = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "RateLimitRule"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 100
          + type                           = "RateLimitRule"

          + match_condition {
              + match_values       = [
                  + "0.0.0.0/0",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = false
              + operator           = "IPMatch"
            }
        }

      + managed_rule {
          + action  = "Block"
          + type    = "Microsoft_DefaultRuleSet"
          + version = "2.1"
        }
      + managed_rule {
          + action  = "Block"
          + type    = "Microsoft_BotManagerRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin.origin will be created
  + resource "azurerm_cdn_frontdoor_origin" "origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "dev-origin"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 1000
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin_group.og will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "og" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "dev-origin-group"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + health_probe {
          + interval_in_seconds = 30
          + path                = "/healthz"
          + protocol            = "Https"
          + request_type        = "GET"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_profile.fd will be created
  + resource "azurerm_cdn_frontdoor_profile" "fd" {
      + id                       = (known after apply)
      + name                     = "dev-fd"
      + resource_group_name      = "dev-rg-hub"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Standard_AzureFrontDoor"
      + tags                     = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
          + "environment" = "dev"
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_route.route will be created
  + resource "azurerm_cdn_frontdoor_route" "route" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "dev-route"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.frontdoor.azurerm_cdn_frontdoor_security_policy.security will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security" {
      + cdn_frontdoor_profile_id = (known after apply)
      + id                       = (known after apply)
      + name                     = "dev-security-policy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.keyvault.azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "eastus"
      + name                            = "dev-kv-dev01"
      + public_network_access_enabled   = false
      + purge_protection_enabled        = true
      + resource_group_name             = "dev-rg-hub"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
          + "environment" = "dev-rg-hub"
        }
      + tenant_id                       = "d1c04857-a0c2-4d18-90f3-3d6561f397c8"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # module.keyvault.azurerm_key_vault_key.cmk[0] will be created
  + resource "azurerm_key_vault_key" "cmk" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = (known after apply)
      + n                       = (known after apply)
      + name                    = "dev-kv-dev01-cmk"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)

      + rotation_policy {
          + expire_after         = "P90D"
          + notify_before_expiry = "P29D"

          + automatic {
              + time_before_expiry = "P30D"
            }
        }
    }

  # module.monitoring.azurerm_application_insights.main will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "dev-appi"
      + resource_group_name                   = "dev-rg-hub"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
          + "environment" = "dev"
        }
      + workspace_id                          = (known after apply)
    }

  # module.monitoring.azurerm_log_analytics_solution.container_insights will be created
  + resource "azurerm_log_analytics_solution" "container_insights" {
      + id                    = (known after apply)
      + location              = "eastus"
      + resource_group_name   = "dev-rg-hub"
      + solution_name         = "ContainerInsights"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + workspace_name        = "dev-law"
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.monitoring.azurerm_log_analytics_solution.security will be created
  + resource "azurerm_log_analytics_solution" "security" {
      + id                    = (known after apply)
      + location              = "eastus"
      + resource_group_name   = "dev-rg-hub"
      + solution_name         = "Security"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + workspace_name        = "dev-law"
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/Security"
          + publisher = "Microsoft"
        }
    }

  # module.monitoring.azurerm_log_analytics_solution.security_center_free will be created
  + resource "azurerm_log_analytics_solution" "security_center_free" {
      + id                    = (known after apply)
      + location              = "eastus"
      + resource_group_name   = "dev-rg-hub"
      + solution_name         = "SecurityCenterFree"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + workspace_name        = "dev-law"
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/SecurityCenterFree"
          + publisher = "Microsoft"
        }
    }

  # module.monitoring.azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "dev-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "dev-rg-hub"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
          + "environment" = "dev"
        }
      + workspace_id                    = (known after apply)
    }

  # module.network.azurerm_network_security_group.aks["workload"] will be created
  + resource "azurerm_network_security_group" "aks" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "dev-nsg-aks-workload"
      + resource_group_name = "dev-rg-workload"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowLoadBalancer"
              + priority                                   = 100
              + protocol                                   = "*"
              + source_address_prefix                      = "AzureLoadBalancer"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
    }

  # module.network.azurerm_network_security_group.appgw will be created
  + resource "azurerm_network_security_group" "appgw" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "dev-nsg-appgw"
      + resource_group_name = "dev-rg-hub"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowHTTPS"
              + priority                                   = 120
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "65200-65535"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowGatewayManager"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "GatewayManager"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowHTTP"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
    }

  # module.network.azurerm_network_security_group.db["workload"] will be created
  + resource "azurerm_network_security_group" "db" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "dev-nsg-db-workload"
      + resource_group_name = "dev-rg-workload"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "1433"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowAKS"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = ""
              + source_address_prefixes                    = [
                  + "10.1.0.0/18",
                ]
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
    }

  # module.network.azurerm_network_security_group.pe will be created
  + resource "azurerm_network_security_group" "pe" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "dev-nsg-pe"
      + resource_group_name = "dev-rg-hub"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
    }

  # module.network.azurerm_private_dns_zone.aks will be created
  + resource "azurerm_private_dns_zone" "aks" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.eastus.azmk8s.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dev-rg-hub"
      + tags                                                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
    }

  # module.network.azurerm_private_dns_zone.keyvault will be created
  + resource "azurerm_private_dns_zone" "keyvault" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dev-rg-hub"
      + tags                                                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
    }

  # module.network.azurerm_private_dns_zone.sql will be created
  + resource "azurerm_private_dns_zone" "sql" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.database.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dev-rg-hub"
      + tags                                                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
    }

  # module.network.azurerm_private_dns_zone.storage_blob will be created
  + resource "azurerm_private_dns_zone" "storage_blob" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dev-rg-hub"
      + tags                                                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
    }

  # module.network.azurerm_private_dns_zone.storage_file will be created
  + resource "azurerm_private_dns_zone" "storage_file" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.file.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dev-rg-hub"
      + tags                                                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
    }

  # module.network.azurerm_private_dns_zone_virtual_network_link.aks_hub will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "aks_hub" {
      + id                    = (known after apply)
      + name                  = "dev-aks-hub-link"
      + private_dns_zone_name = "privatelink.eastus.azmk8s.io"
      + registration_enabled  = false
      + resource_group_name   = "dev-rg-hub"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_private_dns_zone_virtual_network_link.aks_spoke["workload"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "aks_spoke" {
      + id                    = (known after apply)
      + name                  = "dev-aks-workload-link"
      + private_dns_zone_name = "privatelink.eastus.azmk8s.io"
      + registration_enabled  = false
      + resource_group_name   = "dev-rg-hub"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_private_dns_zone_virtual_network_link.keyvault_hub will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "keyvault_hub" {
      + id                    = (known after apply)
      + name                  = "dev-keyvault-hub-link"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "dev-rg-hub"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_private_dns_zone_virtual_network_link.keyvault_spoke["workload"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "keyvault_spoke" {
      + id                    = (known after apply)
      + name                  = "dev-keyvault-workload-link"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "dev-rg-hub"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_private_dns_zone_virtual_network_link.sql_hub will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "sql_hub" {
      + id                    = (known after apply)
      + name                  = "dev-sql-hub-link"
      + private_dns_zone_name = "privatelink.database.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dev-rg-hub"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_private_dns_zone_virtual_network_link.sql_spoke["workload"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "sql_spoke" {
      + id                    = (known after apply)
      + name                  = "dev-sql-workload-link"
      + private_dns_zone_name = "privatelink.database.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dev-rg-hub"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_private_dns_zone_virtual_network_link.storage_blob_hub will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "storage_blob_hub" {
      + id                    = (known after apply)
      + name                  = "dev-storage-blob-hub-link"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dev-rg-hub"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_private_dns_zone_virtual_network_link.storage_blob_spoke["workload"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "storage_blob_spoke" {
      + id                    = (known after apply)
      + name                  = "dev-storage-blob-workload-link"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dev-rg-hub"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_private_dns_zone_virtual_network_link.storage_file_hub will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "storage_file_hub" {
      + id                    = (known after apply)
      + name                  = "dev-storage-file-hub-link"
      + private_dns_zone_name = "privatelink.file.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dev-rg-hub"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_private_dns_zone_virtual_network_link.storage_file_spoke["workload"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "storage_file_spoke" {
      + id                    = (known after apply)
      + name                  = "dev-storage-file-workload-link"
      + private_dns_zone_name = "privatelink.file.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dev-rg-hub"
      + tags                  = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.network.azurerm_resource_group.hub will be created
  + resource "azurerm_resource_group" "hub" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "dev-rg-hub"
      + tags     = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
          + "environment" = "dev"
          + "tier"        = "hub"
        }
    }

  # module.network.azurerm_resource_group.spoke_rg["workload"] will be created
  + resource "azurerm_resource_group" "spoke_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "dev-rg-workload"
      + tags     = {
          + "CostCenter"  = "IT-Development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "azureapp"
          + "environment" = "dev"
          + "tier"        = "spoke-workload"
        }
    }

  # module.network.azurerm_subnet.aks["workload"] will be created
  + resource "azurerm_subnet" "aks" {
      + address_prefixes                               = [
          + "10.1.0.0/18",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-aks"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "dev-rg-workload"
      + virtual_network_name                           = "dev-vnet-workload"
    }

  # module.network.azurerm_subnet.appgw will be created
  + resource "azurerm_subnet" "appgw" {
      + address_prefixes                               = [
          + "10.0.0.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-appgw"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "dev-rg-hub"
      + virtual_network_name                           = "dev-vnet-hub"
    }

  # module.network.azurerm_subnet.bastion will be created
  + resource "azurerm_subnet" "bastion" {
      + address_prefixes                               = [
          + "10.0.2.0/26",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "dev-rg-hub"
      + virtual_network_name                           = "dev-vnet-hub"
    }

  # module.network.azurerm_subnet.db["workload"] will be created
  + resource "azurerm_subnet" "db" {
      + address_prefixes                               = [
          + "10.1.128.0/20",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-db"
      + private_endpoint_network_policies              = "Disabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "dev-rg-workload"
      + virtual_network_name                           = "dev-vnet-workload"
    }

  # module.network.azurerm_subnet.firewall will be created
  + resource "azurerm_subnet" "firewall" {
      + address_prefixes                               = [
          + "10.0.3.0/26",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_networ

... (truncated)
  ```
  
  </details>
  
  *Pusher: @suddhasish, Action: `pull_request`*